In [1]:
import os

import pandas as pd

In [2]:
def cwd_level_up(path):
    """Set current working directory one level higher in path."""

    new_path = os.path.dirname(path)

    os.chdir(new_path)


cwd_level_up(os.getcwd())

In [3]:
CATEGORIES_RAW = pd.read_csv('categories/part-00000', header=None)

CATEGORIES_RAW.columns = [
    'category_id', 'category_department_id', 'category_name'
]

CATEGORIES_RAW.head()

   category_id  category_department_id        category_name
0            1                       2             Football
1            2                       2               Soccer
2            3                       2  Baseball & Softball
3            4                       2           Basketball
4            5                       2             Lacrosse

In [13]:
CATEGORIES_RAW.isna().sum()

category_id               0
category_department_id    0
category_name             0
dtype: int64

In [4]:
CUSTOMERS_RAW = pd.read_csv('customers/part-00000', header=None)

CUSTOMERS_RAW.columns = [
    'customer_id', 'customer_fname', 'customer_lname', 'customer_email',
    'customer_password', 'customer_street', 'customer_city', 'customer_state',
    'customer_zipcode'
]

CUSTOMERS_RAW.head()

,customer_id,customer_fname,customer_lname,customer_email,customer_password,customer_street,customer_city,customer_state,customer_zipcode
0,1,Richard,Hernandez,XXXXXXXXX,XXXXXXXXX,6303 Heather Plaza,Brownsville,TX,78521
1,2,Mary,Barrett,XXXXXXXXX,XXXXXXXXX,9526 Noble Embers Ridge,Littleton,CO,80126
2,3,Ann,Smith,XXXXXXXXX,XXXXXXXXX,3422 Blue Pioneer Bend,Caguas,PR,725
3,4,Mary,Jones,XXXXXXXXX,XXXXXXXXX,8324 Little Common,San Marcos,CA,92069
4,5,Robert,Hudson,XXXXXXXXX,XXXXXXXXX,10 Crystal River Mall,Caguas,PR,725

In [14]:
CUSTOMERS_RAW.isna().sum()

customer_id          0
customer_fname       0
customer_lname       0
customer_email       0
customer_password    0
customer_street      0
customer_city        0
customer_state       0
customer_zipcode     0
dtype: int64

In [5]:
ORDER_ITEMS_RAW = pd.read_csv('order_items/part-00000', header=None)

ORDER_ITEMS_RAW.columns=[
    'order_item_id', 'order_item_order_id', 'order_item_product_id',
    'order_item_quantity', 'order_item_subtotal', 'order_item_price'
]

ORDER_ITEMS_RAW.head()

,order_item_id,order_item_order_id,order_item_product_id,order_item_quantity,order_item_subtotal,order_item_price
0,1,1,957,1,299.98,299.98
1,2,2,1073,1,199.99,199.99
2,3,2,502,5,250.00,50.00
3,4,2,403,1,129.99,129.99
4,5,4,897,2,49.98,24.99

In [16]:
ORDER_ITEMS_RAW.isna().sum()

order_item_id            0
order_item_order_id      0
order_item_product_id    0
order_item_quantity      0
order_item_subtotal      0
order_item_price         0
dtype: int64

In [6]:
ORDERS_RAW = pd.read_csv('orders/part-00000', header=None)

ORDERS_RAW.columns = [
    'order_id', 'order_date', 'order_customer_id', 'order_status'
]

ORDERS_RAW.head()

   order_id             order_date  order_customer_id     order_status
0         1  2013-07-25 00:00:00.0              11599           CLOSED
1         2  2013-07-25 00:00:00.0                256  PENDING_PAYMENT
2         3  2013-07-25 00:00:00.0              12111         COMPLETE
3         4  2013-07-25 00:00:00.0               8827           CLOSED
4         5  2013-07-25 00:00:00.0              11318         COMPLETE

In [17]:
ORDERS_RAW.isna().sum()

order_id             0
order_date           0
order_customer_id    0
order_status         0
dtype: int64

In [10]:
ORDERS_RAW.order_status.unique()

array(['CLOSED', 'PENDING_PAYMENT', 'COMPLETE', 'PROCESSING',
       'PAYMENT_REVIEW', 'PENDING', 'ON_HOLD', 'CANCELED',
       'SUSPECTED_FRAUD'], dtype=object)

In [9]:
PRODUCTS_RAW = pd.read_csv('products/part-00000', header=None)

PRODUCTS_RAW.columns = [
    'product_id', 'product_category_id', 'product_name', 'product_description',
    'product_price', 'product_image'
]

PRODUCTS_RAW.head()

,product_id,product_category_id,product_name,product_description,product_price,product_image
0,1,2,Quest Q64 10 FT. x 10 FT. Slant Leg Instant U,NaN,59.98,http://images.acmesports.sports/Quest+Q64+10+F...
1,2,2,Under Armour Men's Highlight MC Football Clea,NaN,129.99,http://images.acmesports.sports/Under+Armour+M...
2,3,2,Under Armour Men's Renegade D Mid Football Cl,NaN,89.99,http://images.acmesports.sports/Under+Armour+M...
3,4,2,Under Armour Men's Renegade D Mid Football Cl,NaN,89.99,http://images.acmesports.sports/Under+Armour+M...
4,5,2,Riddell Youth Revolution Speed Custom Footbal,NaN,199.99,http://images.acmesports.sports/Riddell+Youth+...

In [18]:
PRODUCTS_RAW.isna().sum()

product_id                0
product_category_id       0
product_name              0
product_description    1003
product_price             0
product_image             0
dtype: int64

In [24]:
ORDERS_MERGED = pd.merge(
    ORDERS_RAW, ORDER_ITEMS_RAW,
    left_on='order_id', 
    right_on='order_item_order_id'
)

In [25]:
ORDERS_MERGED.columns

Index(['order_id', 'order_date', 'order_customer_id', 'order_status',
       'order_item_id', 'order_item_order_id', 'order_item_product_id',
       'order_item_quantity', 'order_item_subtotal', 'order_item_price'],
      dtype='object')

In [27]:
ORDERS_MERGED = ORDERS_MERGED[['order_date', 'order_status','order_item_product_id',
       'order_item_quantity', 'order_item_subtotal', 'order_item_price']]

In [30]:
ORDERS_COMPLETE = ORDERS_MERGED.loc[ORDERS_MERGED.order_status == 'COMPLETE']


ORDERS_COMPLETE.head()

,order_date,order_status,order_item_product_id,order_item_quantity,order_item_subtotal,order_item_price
8,2013-07-25 00:00:00.0,COMPLETE,957,1,299.98,299.98
9,2013-07-25 00:00:00.0,COMPLETE,365,5,299.95,59.99
10,2013-07-25 00:00:00.0,COMPLETE,1014,2,99.96,49.98
11,2013-07-25 00:00:00.0,COMPLETE,957,1,299.98,299.98
12,2013-07-25 00:00:00.0,COMPLETE,403,1,129.99,129.99

In [31]:
ORDERS_COMPLETE.shape

(56740, 6)

In [45]:
ORDERS_COMPLETE['order_date'] = pd.to_datetime(ORDERS_COMPLETE.order_date)

/var/folders/m6/1fg6kb812rl0xdc7jq5sp3km0000gn/T/ipykernel_62941/4039592531.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  ORDERS_COMPLETE['order_date'] = pd.to_datetime(ORDERS_COMPLETE.order_date)

In [57]:
ORDERS_COMPLETE.order_date.max() - timedelta(days=7)

Timestamp('2014-07-17 00:00:00')

In [51]:
from sqlalchemy import create_engine

db_string = 
db = create_engine(db_string)

In [52]:
ORDERS_COMPLETE.to_sql('orders', con=db, schema='scd')

740

In [53]:
from datetime import timedelta